#!/bin/csh
#----------------------------------------------------------------------#
# Shell-id     : supbd2002
# Shell-名     : supbd2002.csh
# 機能         : ダミー・シェル
# 作成者       : T.haruyama
# 作成日       : 2003/12/30
# 修正履歴     :
# Ｎｏ   修正日付   修正者     修正内容
#    1  yyyy/mm/dd  XXXXXXXXX  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
#    x  2006/05/12  M.Tanaka    Ｅ１０Ｋ移行ガイドライン対応
#----------------------------------------------------------------------#
#----------------------------------------------------------------------#
# 初期処理部
#----------------------------------------------------------------------#
#E10K BEF#set SUBSRCDIR="/prod/jcl/sub"
set PROD_DIR = /prod
set SUBSRCDIR="${PROD_DIR}/jcl/sub"
source $SUBSRCDIR/upbd.src
source $SUBSRCDIR/common.src
#
#----------------------------------------------------------------------#
# メイン部
#----------------------------------------------------------------------#
echo "DUMMY-SHELL"  >> $LOG_FILE
#----------------------------------------------------------------------#
# 後処理部
#----------------------------------------------------------------------#
echo "$SHELLNAME:t :  end  time : `date +%y/%m/%d:%H:%M:%S`" >> $LOG_FILE
exit $NORMAL
