#!/bin/csh
#----------------------------------------------------------------------------#
# Ｓｈｅｌｌ−ｉｄ： supbd2020
# Ｓｈｅｌｌ名    ： supbd2020.csh
# 機能            ： ＴＡＢＬＥ ＢＡＣＫ−ＵＰ (利用者_取引先)
#
# 作成者　　　　　： T.HARUYAMA
# 作成日　　　　　： 2004/02/29
# 修正履歴　　　　：
#    x  2006/05/12  M.Tanaka    Ｅ１０Ｋ移行ガイドライン対応
#    １ 2006/05/26  K.Shimada   export.src -> export2.src 対応
#----------------------------------------------------------------------------#
#----------------------------------------------------------------------------#
# 初期処理部
#----------------------------------------------------------------------------#
#E10K BEF#set SUBSRCDIR="/prod/jcl/sub"
set PROD_DIR = /prod
set SUBSRCDIR="${PROD_DIR}/jcl/sub"

source $SUBSRCDIR/upbd.src
source $SUBSRCDIR/common.src
#
set SH_ARGC=3
set DMP_DIR=$WKDIR
set DMP_FILE_001=$DMP_DIR/upm180_exp_$ORAUID.dmp
#E10K BEF#set EXPORT_DIR="/prod/ora8/export"

#----------------------------------------------------------------------------#
# メイン部
#----------------------------------------------------------------------------#
#----------------------------------------------------------------------------#
# アーギュメントチェック処理
#----------------------------------------------------------------------------#
source $SUBSRCDIR/argchk.src
if ( $status != $NORMAL ) then
    exit $ABEND
endif
#----------------------------------------------------------------------------#
# 入力ファイルチェック／データバックアップ
#----------------------------------------------------------------------------#
#----------------------------------------------------------------------------#
# TABLE: UPM_利用者_取引先
#----------------------------------------------------------------------------#
#E10K BEF#set EXPORT_SQL=`cat $EXPORT_DIR/upm180.ctl`
#E10K BEF#set EXPORT_PARM = $EXPORT_DIR/exp_tbl.par
#E10K BEF#set EXPORT_CHK  = $EXPORT_DIR/upm180_exp_tbl_$ORAUID.ctl
#E10K BEF#set CHECKFILE   = $EXPORT_CHK
set EXPORT_SQL  = $EXPORT_DIR/upm180_exp_tbl_$ORAUID.ctl
set CHECKFILE   = $EXPORT_SQL
set DMP_FILE    = $DMP_FILE_001
#
source $SUBSRCDIR/filechk.src
if ( $status != $NORMAL ) then
    exit $ABEND
endif
#

#E10K BEF#source $SUBSRCDIR/export.src
source $SUBSRCDIR/export2.src
if ( $status != $NORMAL ) then
    exit $ABEND
endif

#
#----------------------------------------------------------------------------#
# 圧縮ファイル削除
#----------------------------------------------------------------------------#
#E10K BEF#rm $DMP_FILE_001.Z
rm $DMP_FILE_001.gz
#
#----------------------------------------------------------------------------#
# ＥＸＰＯＲＴファイル圧縮
#----------------------------------------------------------------------------#
#E10K BEF#compress $DMP_FILE_001
gzip $DMP_FILE_001
if ( $status != $NORMAL ) then
    exit $ABEND
endif
#
#----------------------------------------------------------------------------#
# 後処理部
#----------------------------------------------------------------------------#
exit $NORMAL
