00001 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
00002 *  REMARKS                                                      *
00003 *      COPY-NAME  Ž¿Ž¸ŽÊŽÞŽ² ŽÖŽ³ Ž´ŽØŽ± SKU ŽÌŽ§Ž²ŽÙ       100 BYTE          *
00004 *      WRITTEN    H385-MKC-M.ITOH             00/10/23          *
00005 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
00006      03 UEU721-NOU-AREA.
00007         05 UEU721-NOU-AREA9       PIC  9(03).
00008      03 UEU721-SKU-CD.
00009         05 UEU721-SKU-CD9         PIC  9(06).
00010      03 UEU721-ATESAKI-CD.
00011         05 UEU721-TORIHIKI-CD9    PIC  9(06).
00012         05 UEU721-KBN-CD9         PIC  9(02).
00012      03 UEU721-VDR.
00013         05 UEU721-VDR9            PIC  9(06).
00014      03 UEU721-TOR-CD.
00015         05 UEU721-TOR-CD9         PIC  9(06).
00016      03 UEU721-HKEITAI-K.
00017         05 UEU721-HKEITAI-K9      PIC  9(01).
00018      03 UEU721-SKU-NN             PIC  X(44).
00019      03 UEU721-MAKER-CD.
00020         05 UEU721-MAKER-CD9       PIC  9(06).
00021      03 FILLER                    PIC  X(21).
