00001 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
00002 *  REMARKS                                                      *
00003 *      COPY-NAME  ŽÄŽØŽÂŽ·ŽÞŽÖŽ³ŽÎŽÝŽ»ŽÞŽ¯Ž¼ŽÏŽ½ŽÀŽ°            51 BYTE          *
00004 *      WRITTEN    T.HARUYAMA                   03/12/12         *
00005 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
00006      03 UEU723-HUKEN-CD.                                         
00007         05 UEU723-HUKEN-CD9       PIC  9(02).                    
00008      03 UEU723-MEIGARA-CD.                                       
00009         05 UEU723-MEIGARA-CD9     PIC  9(06).                    
00010      03 UEU723-TOR-CD.                                           
00011         05 UEU723-TOR-CD9         PIC  9(06).                    
00012      03 UEU723-SYUPPAN-CD.                                       
00013         05 UEU723-SYUPPAN-CD9     PIC  9(06).                    
00014      03 FILLER                    PIC  X(30).                    
00014      03 UEU723-KAI-CD             PIC  X(01).                    

